main.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Melby</title>
<meta name="author" content="Linus Arver" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.googleapis.com" />
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin />
<link rel="stylesheet" href="https://fonts.googleapis.com/css2?family=Source+Serif+Pro:wght@400;700&family=Source+Sans+Pro:wght@400;700&family=Source+Code+Pro">
<link rel="stylesheet" type="text/css" href="syntax-highlighting.css"/>
<link rel="stylesheet" type="text/css" href="lilac.css" />
<!-- LILAC_HTML_HEAD -->
</head>
<body>
<div id="content" class="content">
<h1 class="title">Melby</h1>
<div id="table-of-contents" role="doc-toc">

<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-Introduction">1. Introduction</a>
<ul>
<li><a href="#h-How-the-rest-of-the-documentation-is-organized">1.1. How the rest of the documentation is organized</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-h-Introduction" class="outline-2">
<h2 id="h-Introduction"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-h-Introduction">
<p>
NOTE: THIS PROJECT IS NOT EVEN BETA. EXPECT REGULAR BREAKAGES.
</p>

<div class="sidenote" id="org0000000">
<p>
The name <i>melby</i> comes from <i>Melbourne</i>, the capital city of the state of
Victoria, Australia.
</p>

</div>

<p>
Melby is a configurable <b>shell prompt generation system</b>. Typically, users
customize their shell prompt by making it run a collection of useful shell
commands, such as <code>git</code> for Git status information, and piecing this output
together into the <code>PS1</code> shell variable found in most shells. This is problematic
when those commands can take a long time (more than a few seconds) to run,
because it introduces a delay between each shell prompt generation. Nobody likes
to wait a few seconds for the shell prompt to finish rendering.
</p>

<p>
Users are then forced to strip down the commands used for the shell prompt to
only those commands that run very quickly. Melby was written to generate a shell
prompt string in under 1 second, even if the commands used for gathering
information to be used by the shell prompt take much longer. Melby achieves this
by running things asynchronously and caching results.
</p>
</div>

<div id="outline-container-h-How-the-rest-of-the-documentation-is-organized" class="outline-3">
<h3 id="h-How-the-rest-of-the-documentation-is-organized"><span class="section-number-3">1.1.</span> How the rest of the documentation is organized</h3>
<div class="outline-text-3" id="text-h-How-the-rest-of-the-documentation-is-organized">
<p>
There are two manuals in this project:
</p>

<ol class="org-ol">
<li><a href="developer-manual.html">Developer Manual</a></li>
<li><a href="user-manual.html">User Manual</a></li>
</ol>

<p>
The <a href="developer-manual.html"><b>Developer Manual</b></a> is written to help other programmers understand how
everything works, while the <a href="user-manual.html"><b>User Manual</b></a> is written for end-users.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
